app/views/orders/show.html.erb

<h2>Orders</h2>
<% @order.order_details.each do |order_detail| %>
---
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 1
SELECT `orders`.* FROM `orders`

  <strong>orderer:</strong>
    <%users= User.where(id: order_detail.user_id)%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1