app/controllers/order_details_controller.rb

	def create
    @order = Order.find(params[:order_id])
    @order_detail = @order.order_details.create(order_details_params)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = NULL LIMIT 1
INSERT INTO `order_details` (`orderer`, `item`, `amount`, `price`, `comment`, `order_id`, `created_at`, `updated_at`) VALUES ('hesham', 'fool ', 3, 15, 'bl t7ena', 1, '2016-04-25 05:50:25', '2016-04-25 05:50:25')