app/controllers/orders_controller.rb

INSERT INTO `orders` (`status`, `name`, `description`, `created_at`, `updated_at`) VALUES ('waiting', 'breakfast', 'test 8lt 3aizeen nakol', '2016-04-26 16:05:28', '2016-04-26 16:05:28')
INSERT INTO `activities` (`owner_id`, `owner_type`, `key`, `trackable_id`, `trackable_type`, `created_at`, `updated_at`) VALUES (1, 'User', 'order.create', 36, 'Order', '2016-04-27 15:35:25', '2016-04-27 15:35:25')
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
        if User.joins(:friendships).select('users.name').include? current_user.name
         @order.create_activity :create, owner: current_user

UPDATE `orders` SET `status` = 'finished', `updated_at` = '2016-04-26 06:36:33' WHERE `orders`.`id` = 3
---
  def update
    respond_to do |format|
      if @order.update(order_params)