app/controllers/pages_controller.rb

	def index
		@acivities = PublicActivity::Activity.order("created_at desc")
---
SELECT `activities`.* FROM `activities`  ORDER BY created_at desc